{
  "basics": {
    "name": "AnnaElaine (Anna) Rosengart",
    "image": "",
    "email": "arosenga@andrew.cmu.edu",
    "url": "https://aerosengart.github.io",
    "summary": "A Ph.D. candidate in the Department of Statistics & Data Science at Carnegie Mellon University. I primarily do work related to analysis of biomedical data. Currently, I am focused on statistical methods for wastewater-based epidemiology.",
    "location": {
      "city": "Pittsburgh",
      "countryCode": "US",
      "region": "Pennsylvania"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "aerosengart",
        "url": "https://github.com/aerosengart"
      }
    ]
  },
  "work": [
    {
      "name": "Handshake Model Validation Expert Fellowship",
      "position": "AI Validation Fellow",
      "startDate": "2025-07",
      "endDate": "2025-08",
      "summary": "Developed prompts for large language model evaluation.",
      "highlights": ["AI"]
    },
    {
      "name": "Center for Systems Immunology, University of Pittsburgh",
      "position": "Laboratory Intern",
      "startDate": "2023-06",
      "endDate": "2023-08",
      "summary": "Applied large language modeling tools to prediction tasks in protein binding. Led code composition and documentation for construction, training, and use of protein binding Transformer.",
      "highlights": ["LLM", "proteins"]
    },
    {
      "name": "Center for Systems Immunology, University of Pittsburgh",
      "position": "Laboratory Intern",
      "startDate": "2022-02",
      "endDate": "2022-08",
      "summary": "Developed methodology for identification of putative mechanisms of disease from multi-omic biomedical data. Composed and documented code.",
      "highlights": ["multi-omics", "machine learning"]
    },
    {
      "name": "Pittsburgh Trauma Research Center, University of Pittsburgh",
      "position": "Trauma Atlas Intern",
      "startDate": "2021-06",
      "endDate": "2021-08",
      "summary": "Analyzed scale, multi-omics data from experimental trials in trauma patient treatments. Composed sample code scripts for data cleaning, visualization, and gene set enrichment analysis to fellow researchers. Implemented consensus-based feature selection for dimension reduction."
    },
    {
      "name": "Department of Statistics, University of Michigan",
      "position": "Undergraduate Research Trainee",
      "startDate": "2021-01",
      "endDate": "2021-05",
      "summary": "Trained in performing time series analysis and statistical modeling of stochastic processes for epidemiological study using partially observed Markov processes.",
      "highlights": ["time series", "epidemiology"]
    },
    {
      "name": "Center for Biologic Imaging, University of Pittsburgh",
      "position": "Laboratory Intern",
      "startDate": "2020-09",
      "endDate": "2020-12",
      "summary": "Worked on the development of efficient and accurate computational methodologies for analysis of large-scale experimental biomedical imaging data. Adapted preexisting software and the development of a software pipeline for cleaning, manipulating, and mapping terabyte-scale mouse brain imaging slices to the Allen Mouse Brain Atlas.",
      "highlights": ["imaging"]
    }

  ],
  "education": [
    {
      "institution": "Carnegie Mellon University",
      "location": "Pittsburgh, PA, USA",
      "url": "https://www.cmu.edu",
      "area": "Statistics",
      "studyType": "Doctor of Philosophy",
      "startDate": "2022-08",
      "endDate": ""
    },
    {
      "institution": "Carnegie Mellon University",
      "location": "Pittsburgh, PA, USA",
      "url": "https://www.cmu.edu",
      "area": "Statistics",
      "studyType": "Master of Science",
      "startDate": "2022-08",
      "endDate": "2024-05",
      "score": "3.99"
    },
    {
      "institution": "University of Michigan",
      "location": "Ann Arbor, MI, USA",
      "url": "https://umich.edu",
      "area": "Data Science",
      "studyType": "Bachelor of Science",
      "startDate": "2017-08",
      "endDate": "2021-12",
      "score": "3.91"
    },
    {
      "institution": "University of Michigan",
      "location": "Ann Arbor, MI, USA",
      "url": "https://umich.edu",
      "area": "Jazz Studies",
      "studyType": "Bachelor of Fine Arts",
      "startDate": "2017-08",
      "endDate": "2021-12",
      "score": "3.91"
    }
  ],
  "awards": [
    {
      "title": "Phi Beta Kappa",
      "date": "2021-12",
      "url": "https://www.pbk.org"
    }
  ],
  "publications": [
    {
      "name": "Multi-Omic Admission-Based Prognostic Biomarkers Identified by Machine Learning Algorithms Predict Patient Recovery and 30-Day Survival in Trauma Patients",
      "publisher": "MDPI",
      "releaseDate": "2022-08-23",
      "url": "https://www.mdpi.com/2218-1989/12/9/774",
      "summary": "Admission-based circulating biomarkers for the prediction of outcomes in trauma patients could be useful for clinical decision support. It is unknown which molecular classes of biomolecules can contribute biomarkers to predictive modeling. Here, we analyzed a large multi-omic database of over 8500 markers (proteomics, metabolomics, and lipidomics) to identify prognostic biomarkers in the circulating compartment for adverse outcomes, including mortality and slow recovery, in severely injured trauma patients. Admission plasma samples from patients (n = 129) enrolled in the Prehospital Air Medical Plasma (PAMPer) trial were analyzed using mass spectrometry (metabolomics and lipidomics) and aptamer-based (proteomics) assays. Biomarkers were selected via Least Absolute Shrinkage and Selection Operator (LASSO) regression modeling and machine learning analysis. A combination of five proteins from the proteomic layer was best at discriminating resolvers from non-resolvers from critical illness with an Area Under the Receiver Operating Characteristic curve (AUC) of 0.74, while 26 multi-omic features predicted 30-day survival with an AUC of 0.77. Patients with traumatic brain injury as part of their injury complex had a unique subset of features that predicted 30-day survival. Our findings indicate that multi-omic analyses can identify novel admission-based prognostic biomarkers for outcomes in trauma patients. Unique biomarker discovery also has the potential to provide biologic insights."
    },
    {
      "name": "High-dimensional proteomics identifies organ injury patterns associated with outcomes in human trauma",
      "publisher": "The Journal of Trauma and Acute Care Surgery",
      "releaseDate": "2023-06",
      "url": "https://journals.lww.com/jtrauma/abstract/2023/06000/high_dimensional_proteomics_identifies_organ.9.aspx",
      "summary": "Severe traumatic injury with shock can lead to direct and indirect organ injury; however, tissue-specific biomarkers are limited in clinical panels. We used proteomic and metabolomic databases to identify organ injury patterns after severe injury in humans."
    },
    {
      "name": "SLIDE: Significant Latent Factor Interaction Discovery and Exploration across biological domains",
      "publisher": "Nature Methods",
      "releaseDate": "2024-02-19",
      "url": "https://www.nature.com/articles/s41592-024-02175-z",
      "summary": "Modern multiomic technologies can generate deep multiscale profiles. However, differences in data modalities, multicollinearity of the data, and large numbers of irrelevant features make analyses and integration of high-dimensional omic datasets challenging. Here we present Significant Latent Factor Interaction Discovery and Exploration (SLIDE), a first-in-class interpretable machine learning technique for identifying significant interacting latent factors underlying outcomes of interest from high-dimensional omic datasets. SLIDE makes no assumptions regarding data-generating mechanisms, comes with theoretical guarantees regarding identifiability of the latent factors/corresponding inference, and has rigorous false discovery rate control. Using SLIDE on single-cell and spatial omic datasets, we uncovered significant interacting latent factors underlying a range of molecular, cellular and organismal phenotypes. SLIDE outperforms/performs at least as well as a wide range of state-of-the-art approaches, including other latent factor approaches. More importantly, it provides biological inference beyond prediction that other methods do not afford. Thus, SLIDE is a versatile engine for biological discovery from modern multiomic datasets."
    },
    {
      "name": "Informing policy via dynamic models: Cholera in Haiti",
      "publisher": "PLOS Computational Biology",
      "releaseDate": "2024-04-29",
      "url": "https://dx.plos.org/10.1371/journal.pcbi.1012032",
      "summary": "Public health decisions must be made about when and how to implement interventions to control an infectious disease epidemic. These decisions should be informed by data on the epidemic as well as current understanding about the transmission dynamics. Such decisions can be posed as statistical questions about scientifically motivated dynamic models. Thus, we encounter the methodological task of building credible, data-informed decisions based on stochastic, partially observed, nonlinear dynamic models. This necessitates addressing the tradeoff between biological fidelity and model simplicity, and the reality of misspecification for models at all levels of complexity. We assess current methodological approaches to these issues via a case study of the 2010-2019 cholera epidemic in Haiti. We consider three dynamic models developed by expert teams to advise on vaccination policies. We evaluate previous methods used for fitting these models, and we demonstrate modified data analysis strategies leading to improved statistical fit. Specifically, we present approaches for diagnosing model misspecification and the consequent development of improved models. Additionally, we demonstrate the utility of recent advances in likelihood maximization for high-dimensional nonlinear dynamic models, enabling likelihood-based inference for spatiotemporal incidence data using this class of models. Our workflow is reproducible and extendable, facilitating future investigations of this disease system."
    }, 
    {
      "name": "Spatiotemporal Variability of the Pepper Mild Mottle Virus Biomarker in Wastewater",
      "publisher": "ACS ES&T Water",
      "releaseDate": "2024-12-16",
      "url": "https://pubs.acs.org/doi/10.1021/acsestwater.4c00866",
      "summary": "Since the start of the coronavirus-19 pandemic, the use of wastewater-based epidemiology (WBE) for disease surveillance has increased throughout the world. Because wastewater measurements are affected by external factors, processing WBE data typically includes a normalization step in order to adjust wastewater measurements (e.g., viral ribonucleic acid (RNA) concentrations) to account for variation due to dynamic population changes, sewer travel effects, or laboratory methods. Pepper mild mottle virus (PMMoV), a plant RNA virus abundant in human feces and wastewater, has been used as a fecal contamination indicator and has been used to normalize wastewater measurements extensively. However, there has been little work to characterize the spatiotemporal variability of PMMoV in wastewater, which may influence the effectiveness of PMMoV for adjusting or normalizing WBE measurements. Here, we investigate its variability across space and time using data collected over a two-year period from sewage treatment plants across the United States. We find that most variation in PMMoV measurements can be attributed to longitude and latitude followed by site-specific variables. Further research into cross-geographical and -temporal comparability of PMMoV-normalized pathogen concentrations would strengthen the utility of PMMoV in WBE."
    },
    {
      "name": "Sliding Window Interaction Grammar (SWING): a generalized interaction language model for peptide and protein interactions",
      "publisher": "Nature Methods",
      "releaseDate": "2025-07-28",
      "url": "https://www.nature.com/articles/s41592-025-02723-1",
      "summary": "Protein language models embed protein sequences for different tasks. However, these are suboptimal at learning the language of protein interactions. We developed an interaction language model (iLM), Sliding Window Interaction Grammar (SWING) that leverages differences in amino-acid properties to generate an interaction vocabulary. SWING successfully predicted both class I and class II peptide–major histocompatibility complex interactions. Furthermore, the class I SWING model could uniquely cross-predict class II interactions, a complex prediction task not attempted by existing methods. Using human class I and II data, SWING accurately predicted murine class II peptide–major histocompatibility interactions involving risk alleles in systemic lupus erythematosus and type 1 diabetes. SWING accurately predicted how variants can disrupt specific protein–protein interactions, based on sequence information alone. SWING outperformed passive uses of protein language model embeddings, demonstrating the value of the unique iLM architecture. Overall, SWING is a generalizable zero-shot iLM that learns the language of protein–protein interactions."
    }
  ],
  "skills": [
    {
      "name": "Statistics and Data Science",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "R",
        "Python",
        "Modeling",
        "Data Visualization",
        "Machine Learning"
      ]
    },
    {
      "name": "Music",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Sibelius",
        "Logic Pro",
        "Music Theory",
        "Composition",
        "Arranging",
        "Trombone",
        "Piano"
      ]
    }
  ]
}
